app/views/sessions/panel.html.erb

						</tr>
						<%= Contest.find_each do |contest| %>
---
SELECT  "contests".* FROM "contests" ORDER BY "contests"."id" ASC LIMIT ?  [["LIMIT", 1000]]