app/views/contests/main.html.erb

SELECT "problems".* FROM "problems" WHERE (contest_id = 1)
---
							</tr>
							<% Problem.where("contest_id = ?", @contest.id).each do |problem| %>