app/controllers/contests_controller.rb

SELECT  "contests".* FROM "contests" WHERE "contests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def main
    @contest = Contest.find_by(id: params[:contest_id])