app/controllers/problems_controller.rb

SELECT  "problems".* FROM "problems" WHERE "problems"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def upload
    uploaded_file = params[:file]
    if !uploaded_file.nil?
      # Check the file extension, if it is wrong flash an error
      if file_extension_check(uploaded_file)
        # Check the file size, if it is over flash an error
        if file_size_check(uploaded_file)
          puts params[:lang]
         thread = Thread.new {
            code_processor = CodeProcessor.new(uploaded_file, Problem.find_by(id: params[:problem_id]), current_user, params[:lang])

SELECT  "problems".* FROM "problems" WHERE "problems"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def main
    @problem = Problem.find_by(id: params[:problem_id])