app/controllers/sessions_controller.rb

SELECT "submissions".* FROM "submissions" WHERE "submissions"."email" = ?  [["email", "1"]]
---
  def submission
    @submissions = Submission.where(email: current_user.id)